AllExamsContentHierarchy/ChannelLevelsTopicsSkills/10+2/BITSATOverlayLevelsTopicsSkills/BITSAT Botany.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rfl="http://www.rulefree.com/RfLoadDataSchema">
   <soapenv:Header />
   <soapenv:Body>
      <LoadLevelsOnlyRequest xmlns="http://www.rulefree.com/RfLoadDataSchema" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.rulefree.com/RfLoadDataSchema RfLoadDataSchema.xsd" reload="true" validateOnly="false">
         <id_system>132</id_system>
         <id_provider>0</id_provider>
         <levelOnlyArray>
            <levelOnly>
               <id_level>301</id_level>
               <subject>InterBotany</subject>
               <subject_header>BITSAT Botany</subject_header>
               <name><![CDATA[Botany]]></name>
               <display_name><![CDATA[Botany]]></display_name>
               <description><![CDATA[Botany preparation for BITSAT]]></description>
               <published>true</published>
               <derived>false</derived>
               <topicOnlyArray>
                  <topicOnly>
                     <id_topic>1</id_topic>
                     <subject>InterBotany</subject>
                     <name>Diversity in Living World</name>
                     <published>true</published>
                     <derived>false</derived>
                     <coreSkillReferenceArray>
                        <coreSkillReference>
                           <id_skill>1</id_skill>
                           <id_skill_reference>10330100202</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>2</id_skill>
                           <id_skill_reference>10330100204</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>3</id_skill>
                           <id_skill_reference>10330100205</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>4</id_skill>
                           <id_skill_reference>10330100302</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>5</id_skill>
                           <id_skill_reference>10330100502</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>6</id_skill>
                            <id_skill_reference>10330100503</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>7</id_skill>
                            <id_skill_reference>10330100504</id_skill_reference>
                        </coreSkillReference>
                     </coreSkillReferenceArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>2</id_topic>
                     <subject>InterBotany</subject>
                     <name>Cell: The Unit of Life; Structure and Function</name>
                     <published>true</published>
                     <derived>false</derived>
                     <coreSkillReferenceArray>
                        <coreSkillReference>
                           <id_skill>1</id_skill>
                           <id_skill_reference>10330101002</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>2</id_skill>
                           <id_skill_reference>10330101003</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>3</id_skill>
                            <id_skill_reference>10330101202</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>4</id_skill>
                            <id_skill_reference>10330101203</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>5</id_skill>
                            <id_skill_reference>10330101103</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>6</id_skill>
                            <id_skill_reference>10330101104</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>7</id_skill>
                            <id_skill_reference>10330200402</id_skill_reference>
                        </coreSkillReference>
                        
                     </coreSkillReferenceArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>3</id_topic>
                     <subject>InterBotany</subject>
                     <name>Structure and Function of Plants</name>
                     <published>true</published>
                     <derived>false</derived>
                     <coreSkillReferenceArray>
                        <coreSkillReference>
                           <id_skill>1</id_skill>
                           <id_skill_reference>10330100602</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>2</id_skill>
                           <id_skill_reference>10330100603</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>3</id_skill>
                           <id_skill_reference>10330100604</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>4</id_skill>
                           <id_skill_reference>10330101302</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>5</id_skill>
                           <id_skill_reference>10330101303</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>6</id_skill>
                           <id_skill_reference>10330101305</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>7</id_skill>
                           <id_skill_reference>10330200202</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>8</id_skill>
                           <id_skill_reference>10330200203</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>9</id_skill>
                           <id_skill_reference>10330200205</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>10</id_skill>
                            <id_skill_reference>10330200206</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>11</id_skill>
                            <id_skill_reference>10330200302</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>12</id_skill>
                            <id_skill_reference>10330200303</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>13</id_skill>
                            <id_skill_reference>10330200304</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>14</id_skill>
                            <id_skill_reference>10330200503</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>15</id_skill>
                            <id_skill_reference>10330200504</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>16</id_skill>
                            <id_skill_reference>10330200505</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>17</id_skill>
                            <id_skill_reference>10330200602</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>18</id_skill>
                            <id_skill_reference>10330200603</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                            <id_skill>19</id_skill>
                            <id_skill_reference>10330200604</id_skill_reference>
                        </coreSkillReference>
                     </coreSkillReferenceArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>4</id_topic>
                     <subject>InterBotany</subject>
                     <name>Reproduction, Growth and Movement in Plants</name>
                     <published>true</published>
                     <derived>false</derived>
                     <coreSkillReferenceArray>
                        <coreSkillReference>
                           <id_skill>1</id_skill>
                           <id_skill_reference>10330100702</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>2</id_skill>
                           <id_skill_reference>10330100703</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>3</id_skill>
                           <id_skill_reference>10330200702</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>4</id_skill>
                           <id_skill_reference>10330200703</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>5</id_skill>
                           <id_skill_reference>10330200705</id_skill_reference>
                        </coreSkillReference>
                         </coreSkillReferenceArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>5</id_topic>
                     <subject>InterBotany</subject>
                     <name>Biotechnology and its Applications</name>
                     <published>true</published>
                     <derived>false</derived>
                     <coreSkillReferenceArray>
                        <coreSkillReference>
                           <id_skill>1</id_skill>
                           <id_skill_reference>10330201202</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>2</id_skill>
                           <id_skill_reference>10330201203</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>3</id_skill>
                           <id_skill_reference>10330201302</id_skill_reference>
                        </coreSkillReference>
                        <coreSkillReference>
                           <id_skill>4</id_skill>
                           <id_skill_reference>10330201502</id_skill_reference>
                        </coreSkillReference>
                         </coreSkillReferenceArray>
                  </topicOnly>
                   </topicOnlyArray>
            </levelOnly>
            <levelOnly>
                <id_level>310</id_level>
                <subject>InterBotany</subject>
                <subject_header>BITSAT Botany</subject_header>
                <name>Mock Subject Exams</name>
                <display_name>Mock Subject Exams</display_name>
                <description>Botany Mock Exams for BITSAT</description>
                <published>true</published>
                <derived>false</derived>
                <topicOnlyArray>
                    <topicOnly>
                        <id_topic>1</id_topic>
                        <subject>InterBotany</subject>
                        <name>BITSAT Botany Practice Exams</name>
                        <published>true</published>
                        <derived>false</derived>
                        <coreSkillReferenceArray>
                            <coreSkillReference>
                                <id_skill>1</id_skill>
                                <id_skill_reference>10330300301</id_skill_reference>
                            </coreSkillReference>
                        </coreSkillReferenceArray>
                    </topicOnly>
                </topicOnlyArray>
            </levelOnly>
          </levelOnlyArray>
      </LoadLevelsOnlyRequest>
   </soapenv:Body>
</soapenv:Envelope>